<div class="row">
    <h1>Nkキッズラボ</h1>
    <p>スクラッチを使ってプログラミング体験をしよう！</p>
</div>
<div class="row">
    <?php echo Asset::img('scratch.jpg',array()) ?>
</div>
<div class="row">
    <div class="__point">
        <div class="col-md-4">
            <h3>
                <span class="__tp">Point <span>1</span></span>
                <span class="__text"><em>論理的思考</em>が身に付く</span>
            </h3>
            <p>まず、プログラミングを学習すると、自然と論理的に物事を考える習慣（クセ）が身に付きます。<br />
実際にプログラムを書いてみても、自分の思い通りに動かないことがあります。<br />
そこで、「なぜ意図したとおりに動かないのか？」「どう指示をすれば動くようになるのか？」といった原因を１つ１つ論理立てて考えながら、解決していくプロセスがプログラミングには欠かせません。<br />
そのような問題解決していく経験が、子どもの「論理的思考力」を伸ばすことにつながります。</p>
        </div>
        <div class="col-md-4">
            <h3>
                <span class="__tp">Point <span>2</span></span>
                <span class="__text">自分のアイデアを<em>形にできる</em></span>
            </h3>
            <p>ゲームやアニメーションなどは、特別なスキルを持った人しか作れないイメージがありませんか？実はプログラミングを学べば、小・中学生でもゲームの画面でキャラクターを動かすといった、プロさながらの作品を作れるようになるのです。（現在は子ども向けのプログラミングサービスも充実しています）実際に、自分の考えたキャラクターを意図した通りに画面の中で動かすことができたり、簡単なゲーム要素を追加したりすることで、子どもたちが普段ゲームの中でしか体験できないような体験を自分の手で創り出すことができます。<br />
そうした経験が子どもたちにとって自信や達成感につながると私たちは考えています。</p>
        </div>
        <div class="col-md-4">
            <h3>
                <span class="__tp">Point <span>3</span></span>
                <span class="__text"><em>将来の仕事</em>でも役に立つ</span>
            </h3>
            <p>2017年現在、プログラマーが国内外問わず不足しています。<br />
今後もますます世界中でネットが普及していきますので、プログラマーの需要はどんどん増えていくと想定されています。<br />
また、将来的にお子さんがどのような職業を選択した場合であっても、パソコンやネットサービスに関わる機会が多くあります。<br />
今後、プログラミングの素養がある人は様々な業種で必要とされるようになるでしょう。</p>
        </div>
    </div>
</div>
<div class="row">
    お問い合わせ
</div>
<?php
//js適用
Asset::js(array('top/top.js'), array(), 'add_js', false);
?>